package lesson_4.hw;

import java.util.Scanner;

public class hw {
    public static void main(String[] args) {
        /**Ввести с клавиатуры два числа m и n.
         Используя цикл for вывести на экран прямоугольник размером m на n из восьмёрок.*/

//        Scanner scan = new Scanner(System.in);
//        int m = scan.nextInt();
//        int n = scan.nextInt();
//        for (int i = 0; i < m; i++) {for (int j = 0; j < n; j++)
//        {System.out.print("8");}
//            System.out.println();}

        /**Используя цикл for вывести на экран прямоугольный треугольник из восьмёрок со сторонами 10 и 10.*/

//        int a = 11;
//        int b = 0;
//        for (int i = 0; i < a; i++) {for (int j = 0; j < b; j++)
//        {System.out.print("8");}
//            b++;
//            System.out.println();}

        /**Ввести с клавиатуры три числа, вывести на экран среднее из них.
         Т.е. не самое большое и не самое маленькое.
         Если все числа равны, вывести любое из них.*/

//        Scanner scan = new Scanner(System.in);
//        int a = scan.nextInt();
//        int b = scan.nextInt();
//        int c = scan.nextInt();
//        if ((a < b && a > c) || (a < c && a > b)) {System.out.println(a);}
//        else if ((b < a && b > c) || (b > a && b < c)) {System.out.println(b);}
//        else if ((c < b && c > a) || (c > b && c < a)) {System.out.println(c);}

        /**Вывести на экран таблицу умножения 10х10 используя цикл while.
         Числа разделить пробелом.*/






    }


}
