package lesson_6;

import java.util.Scanner;

public class hw {
    public static void main(String[] args) {

        /**
         * Задача: Программа вводит строки, пока пользователь не введёт пустую строку (нажав enter).
         Потом она конвертирует строки в верхний регистр (Мама превращается в МАМА) и выводит их на экран.

         Новая задача: Программа вводит строки, пока пользователь не введёт пустую строку (нажав enter).
         Если в строке чётное число букв, строка удваивается, если нечётное - утраивается.
         Программа выводит слова на экран.

         2

         Ввести 5 строк с консоли, найти самую короткую и самую длинную строки. Вывести найденные строки и их длину.

         3

         1. Создать массив на 10 строк.
         2. Ввести с клавиатуры 8 строк и сохранить их в массив.
         3. Вывести содержимое всего массива (10 элементов) на экран в обратном порядке. Каждый элемент - с новой строки.

         4

         1. Создать массив на 10 строк.
         2. Создать массив на 10 чисел.
         3. Ввести с клавиатуры 10 строк, заполнить ими массив строк.
         4. В каждую ячейку массива чисел записать длину строки из массива строк, индекс/номер ячейки
         которой совпадает с текущим индексом из массива чисел.

         5

         1. Считать 6 строк и заполнить ими массив strings.
         2. Удалить повторяющиеся строки из массива strings, заменив их на null (null должны быть не строками "null").*/
        Scanner scan = new Scanner(System.in);
//        String[] a = new String[6];
//        for (int i = 0; i < 6; i++) {
//            a[i] = scan.nextLine();
//        }
//
//        for (int i = 0; i < 6; i++) {
//            for (int j = 0; j < 6; j++) {
//                if (i != j && a[i] != null && a[i] != null && a[i].equals(a[j]))
//                    a[i] = null;
//                a[j] = null;
//
//                    System.out.println(a[i]);

        String [] q = new String[5];
        for (int i = 0; i < 5; i++) {
            q[i] = scan.nextLine();
        }
        for (int i = 0; i < 5; i++) {
            if(q[i].length() > )
        }

    }

}






